module.exports = {
  config: {
    name: "قاعدة_المجموعة",
    version: "1.1",
		author: "NIB",
		countDown: 5,
		role: 0,
		shortDescription: "صورة قمامة",
		longDescription: "صورة سلة المهملات",
		category: "النظام",
		guide: {
			vi: "{pn} [@tag | để trống]",
			en: "{pn} [@تاغ] | الشخص "
    
    }
  },
  onStart: async function ({ event, api }) {
    if (event.type === "event" && event.logMessageType === "log:subscribe") {
      const addedBy = event.logMessageData.addedParticipants[0].userFbId;
      const groupName = event.logMessageData.threadName;
      
      // Customize your autosend message here
      const message = `أهلا يا ${addedBy} نورت مجموعتنا  ${groupName} إليك قواعد المجموعة اللتي عليك إحترامها و تطبيقها.

\t\t💮قواعد وشروط الجروب💮\n
1-احترام آراء الآخرين وعدم التلفظ بألفاظ تخدش الحياء\n
2- الحفاظ على القيم والعادات والتقاليد\n
3- الحفاظ على تعاليم الدين الاسلامي\n
4- المرجو التعامل مع المنشورات الجديه بكل حزم وجد والمنشورات الاخرى
يتعامل فيها كل عضو بمايريد مع العلم ان التعليق يعبر عن شخصيتك\n
5 - عدم وضع صور إباحية ومثيرة جدا وذلك تفاديا لإثارة المشاكل من قبل بعض
الأعضاء
6- عدم إزعاج البنات بطلبات الأضافة داخل الجروب أو الرسائل غير
اللائقة.....يتم تنبيه العضو لمره واحده واذا لم يستجب العضو المعني يحذف
على الفور\n
7- عدم نشر اي صفحه او جروب فيNever Back Down\n
تنبيه العضو لمره واحده واذا لم يستجب العضو المعني يحذف على الفور
8- التشهير والتشويه لعضو ما او إنسان ما ؟ داخل الجروب يمنع منعا باتا
ويتحمل صاحب الموضوع الجزاء وهوا الحذف النهائي\n
9- يرجى عدم نشر المنشورات السياسية لكافة الدول العربية و اى عضو سينشر اى
منشور سياسى سيتم تحذيره مرة واحدة و بعد ذلك سيتم طرد العضو\n
10- أرجو الابلاغ فوراً عن أي شيء مخالف داخل الجروب
11- ممنوع نشر الصور الشخصيه على الجروب او كتابه ارقام الهواتف الخاصه بكم\n
11_السياسه ممنوعه منعا باتا ..................... وبكرر منمنوع السياسه
منعا باتا\n
12_ اى شاب يحاول الدخول باسم بنت مصيره #الطرد
.......اي شخص يسيء للجروب سيتم حظره
...... ? فأتمنى أن نبقى اخوة ? .....
لن نجبر أحداً على دخول المجموعة ولا على البقاء فيها !!!
ولكني ألتمس من الموجودين فيها إحترام قوانينها.
المجموعه منكم ولكم وانتم من يتصرف بمجريات الامور وكلنا تقة فيكم
ارجوا من الجميع الالتزام ولكم خالص الشكر والتقدير على التعاون\nمع خالص الشكر :\n\t\t
 💐مشرفين المجموعة💐`;
      
      // Send the autosend message
      api.sendMessage(message, event.threadID);
    }
  },
};