const fs = require('fs');

module.exports = {
  config: {
    name: "إقتباس",
    author: "حسين يعقوبي",
    aliases: ["aniquot"],
    category: "أنمي",
    shortDescription: {
      en: "إرسال رسالة .",
      tl: "Magpadala ng quote na may imahe."
    },
    longDescription: {
      en: "سيرسل هذا الأمرسيقوم بعرض إقتباس عشوائيًا مع صورة أنمي فخمة.",
      tl: "سيرسل هذا الأمر بعرض إقتباست أنمي عشوائيًا مع صور أنمي فهم ."
    },
    guide: {
      en: "{p}إقتباس ",
      tl: "{p}quote"
    }
  },
  onStart: async function ({ message }) {
    const messages = [
   
    "حياة الناس لا تنتهي عندما يموتون، بل تنتهي عندما يفقدون الإيمان\n\n~ إيتاشي⚙️ أوتشيها⚙️\n(💥ناروتو شيبودن💥)",
    "إذا لم تخاطر، فلن تتمكن من صنع المستقبل\n\n⚓مونكي دي لوفي⚓\n(ون 🏝️🏝🏔️⛰️بيس)",
    "إذا لم يعجبك مصيرك، فلا تقبله\n\n~ 💥ناروتو أوزوماكي💥\n(✨ناروتو شيبودن ✨)",
    "عندما تستسلم، عندها تنتهي اللعبة\n\n~ أنساي ميتسويوشي\n(سلام دنك)",
    "كل ما يمكننا فعله هو أن نعيش حتى اليوم الذي نموت فيه. التحكم بما نستطيع...والطيران بحرية\n\n~ دينيل يونج\n(إخوان الفضاء)",
    "النسيان كالجرح. قد يلتئم الجرح، لكنه ترك ندبة بالفعل\n\n ⚓مونكي دي لوفي⚓\n(ون 🏝️⛰🏝️بيس)",
    "من المؤسف أن تتخلى عن شيء ما قبل أن تجربه\n\n~ ريكو ميكامي\n(آخر)",
    "إذا لم تشارك ألم شخص ما، فلن تتمكن أبدًا من فهمه\n\n~ ناغاتو أوزوماكي\n(ناروتو شيبودن)",
    "مهما خسرت، ستجده مرة أخرى. لكن ما ترميه لن يعود أبدًا\n\n~ هيمورا كينشن\n(روروني كينشن)",
    "ليس علينا أن نعرف ما يخبئه الغد! ولهذا السبب يمكننا أن نعيش بكل ما نستحقه اليوم\n\n~ ناتسو دراغون\n(فيري تيل)",
    "لماذا يجب أن أعتذر لكوني وحشًا؟ هل اعتذر أحد من قبل عن تحويلي إلى واحدة?\n\n~ جيزوو\n(توكيو غول)",
    "يصبح الناس أقوى لأن لديهم ذكريات لا يمكنهم نسيانها\n\n~ تسونادا\n(ناروتو شيبودن)",
    "سأترك مشاكل الغد لنفسي\n\n~ سايتاما\n(ون بونتش مان)",
    "إذا كنت تريد أن تجعل الناس يحلمون، عليك أن تبدأ بالإيمان بهذا الحلم بنفسك\n\n~ سيا كاني\n(أماغي بريليان بارك)",
    "أن تكون وحيدًا أكثر إيلامًا من أن تتأذى\n\n~ مونكي دي لوفي\n(ون بيس)",
    "ليس هناك عيب في السقوط! العار الحقيقي هو عدم الوقوف مرة أخرى\n\n~ شينتارو ميدوريما\n(كوروكوش باسكيت بول)",
    "البساطة هي الطريق الأسهل للجمال الحقيقي\n\n~ سيشو هاندا\n(باراكامون)",
    "إذا كنت لا تستطيع أن تفعل شيئا، فلا تفعل. ركز على ما تستطيع\n\n~ شيرو\n(لوغ أوريزون)",
    "ليس من المفيد التظاهر بأنك لا تستطيع رؤية ما يحدث\n\n~ يويا ميشيزوكي\n(أنوذر)",
    "أن تكون ضعيفًا ليس شيئًا تخجل منه... البقاء ضعيفًا هو ما يدعو للخجل\n\n~ فيوغيلون فيركلين\n(بلاك كلوڤر)",
    "لا تستجدي الأشياء. افعل ذلك بنفسك، وإلا فلن تحصل على أي شيء\n\n~ رونتون ثورستون\n(زيا راين)",
    "الأشخاص الذين لا يستطيعون التخلص من شيء مهم، لا يمكنهم أبدًا أن يأملوا في تغيير أي شيء\n\n~ أرمين أرليت\n(أتاك أون تايتون)",
    "لا يمكننا إضاعة الوقت في القلق بشأن ماذا لو\n\n~ إيتشيغو\n(بليتش)",
    "في بعض الأحيان يكون من الضروري القيام بأشياء غير ضرورية\n\n~ (كاندا)",    "حماية شخص ما تعني منحهم مكانًا ينتمون إليه. منحهم مكانًا يمكنهم أن يكونوا فيه سعداء\n\n~ الأميرة لينيسيا\n(لوغ أوريزون)",
    "إن الاعتقاد بأنك لست جيدًا وعديم القيمة هو أسوأ شيء يمكنك القيام به\n\n~ دورايمون\n(دورايمون)",
    "إذا كنت لا تستطيع أن تفعل شيئا، فلا تفعل. ركز على ما يمكنك فعله\n\n~ شيرو\n(لوغ أوريزون)",
    "عندما تغفل عن طريقك، استمع إلى الوجهة في قلبك\n\n~ ألين والكر\n(دي غراي مان)",
    "الحياة ليست لعبة الحظ. إذا كنت تريد الفوز، فاعمل بجد\n\nلا~ سورا\n(لا لعبة ولا حياة)",
    "مهما كان الأمر صعبًا أو مستحيلًا، لا تغفل أبدًا عن هدفك\n\n~ مونكي دي لوفي\n(ون بيس)",
    "العالم ليس مثاليا. لكنها موجودة من أجلنا، ونبذل قصارى جهدنا.... وهذا ما يجعلها جميلة للغاية\n\n~ روي موستانغ\n(فول أرمي شيميستيك)",
    "الخوف ليس شرا. ويخبرك ما هي نقطة ضعفك. وبمجرد أن تعرف نقاط ضعفك، يمكنك أن تصبح أقوى وأكثر لطفًا\n\n~ جيردات كليف\n(فيري تيل)",
    "معرفة الحزن ليس مخيفا. ما هو مرعب هو معرفة أنه لا يمكنك العودة إلى السعادة التي كان من الممكن أن تحصل عليها\n\n~ ماتسوماتو رانغيكو\n(بليتش)",
    "معرفة أنك مختلف هي البداية فقط. إذا قبلت هذه الاختلافات، فستتمكن من تجاوزها والاقتراب منها أكثر\n\n~ ميس كبوياش\n(دراغون مايد)",
    "إذا لم يرغب أحد في قبولك ويريدك في هذا العالم، فتقبل نفسك وسترى أنك لست بحاجة إليه وإلى أفكاره الأنانية.\n\n~ علي بابا سالوجا\n(ماغي)",
    "عندما تصل إلى نقطة اللاعودة، فهذه هي اللحظة التي تصبح فيها رحلة حقًا. إذا كان لا يزال بإمكانك العودة إلى الوراء، فهذه ليست رحلة حقًا\n\n~ هيناتا ميياك\n(مكان أبعد من الكون)",
    "أولئك الذين يقفون في القمة يحددون ما هو الخطأ وما هو الصواب! نفس هذا المكان هو أرض محايدة! سوف تسود العدالة، ويقول لك؟ بالطبع ستكون كذلك! من يفوز في هذه الحرب يصبح العدالة\n\n~ دون فلامينغو العظيم\n(ون بيس)",
    "يكبر الإنسان عندما يكون قادراً على التغلب على الصعوبات. الحماية مهمة، ولكن هناك بعض الأشياء التي يجب على الإنسان أن يتعلمها بنفسه\n\n~ جيرايا\n(ناروتو شيبودن)",
    "الأخطاء ليست قيوداً تمنع الإنسان من التقدم للأمام. بل هي التي تحفظ القلب وتنميه\n\n~ مافيس ڤيرميلون\n(فيري تيل)",
    "ليس من الممكن دائمًا أن نفعل ما نريد أن نفعله، ولكن من المهم أن نؤمن بشيء ما قبل أن نفعله بالفعل\n\n~ مايت غاي\n(ناروتو شيبودن)",
    "المضي قدمًا لا يعني نسيان الأشياء. هذا يعني فقط أنه عليك قبول ما حدث والاستمرار في العيش\n\n~ إرزا سكارليت\n(فيري تيل)",
    "لا تنزعج بسبب ما لا يمكنك فعله. افعل ما تتقنه، وعش خاليًا من الهموم ومتفائلًا قدر الإمكان، لأن بعض الأشخاص لا يستطيعون القيام بذلك\n\n~ كيما كاتسوراج\n(آلهة العالم فقط يعلمون)",
    "كل شيء له بداية ونهاية. الحياة ما هي إلا دورة من البدايات والتوقفات. هناك نهايات لا نرغب فيها، لكنها حتمية، وعلينا أن نواجهها. هذا هو ما يعنيه الإنسان\n\n~ جيت بلاك\n(كاو بوي هيب)",
    "الدرس بدون ألم لا معنى له. وذلك لأنه لا يمكن لأحد أن يكسب دون التضحية بشيء. ولكن من خلال تحمل هذا الألم والتغلب عليه، سيحصل على قلب قوي لا مثيل له\n\n~ إدوارد إلريك\n(فولمات ألشيميتك: برودر هود)",
    "عليك أن تتقبل حقيقة أنك لست الأفضل وأن يكون لديك كل الإرادة للسعي لتكون أفضل من أي شخص تواجهه\n\n~ رورونوا زورو\n(ون بيس)",
    "لا يمكنك الفوز بلعبة دون القيام بأي شيء. وإذا فاز بها شخص آخر نيابةً عنك، فأنت لم تنجز أي شيء. الحياة هي بنفس الطريقة\n\n~ جونوشيريكا كاغامي\n(دونبا كيوشي)",
    "تمامًا مثل الألعاب، بغض النظر عن مدى حسن ترتيب الأشياء في حياتك، هناك دائمًا شيء يبقيك على أصابع قدميك\n\n~ جونوشيرو كاغامي\n(دونبا كيوشي)",
    "افعل بالضبط ما تريد. وهذا هو المعنى الحقيقي للمتعة. فالمتعة تؤدي إلى الفرح والفرح يؤدي إلى السعادة\n\n~ جيلجاميش\n(فيت زيرو)",
    "لا تفكر في أشياء أخرى، هناك شيء واحد فقط يمكنك القيام به. لذا أتقن هذا الشيء الوحيد. لا تنسى. ما يجب أن تتخيله دائمًا هو أنك أنت الأقوى. لا تحتاج للخروج\n\n~ أرشر\n(فيت ستاي نايت)",
    "لن تدرك أنك تحب شخصًا ما حقًا إلا إذا سبب لك ألمًا هائلاً بالفعل. لن يتمكن أعداؤك من إيذائك أبدًا كما يفعل أحباؤك. الأشخاص القريبون من قلبك هم من يستطيعون العطاء\n\n~ هيمارو كينشن\n(رورورين كينشن)",
    "مفهوم الأمل ليس أكثر من استسلام. كلمة لا تحمل أي معنى حقيقي\n\n~ مادارا أةتشيها\n(ناروتو شيبودن)",
    "كلما طالت عمرك... كلما أدركت أن الواقع مصنوع فقط من الألم والمعاناة والفراغ\n\n~ مادارا أوتشيها\n(ناروتو شيبودن)",
    "عندما يتعلم الإنسان الحب، عليه أن يتحمل مخاطر الكراهية\n\n~ مادارا أوتشيها\n(ناروتو شيبودن)",
    "الحياة عبارة عن لغز يحدث في أيامنا الأولى، ولكن مع تقدمنا في العمر أكثر فأكثر، نبدأ في إدراك معنى الحياة والنمط الذي تسير به. إنه في الواقع ليس سوى خلق، فول\n\n~ مادارا أوتشيها \n(ناروتو شيبودن)",    
    "لن تتمكن أبدًا من حب أي شخص آخر حتى تحب نفسك\n\n~ ليلوش لومبرغوش\n(كود غاس)",
    "لا توجد طريقة يمكننا أن نلتقي بها. ولكن شيء واحد مؤكد. إذا رأينا بعضنا البعض، فسوف نعرف. بأنك أنت من كان بداخلي. أنني كنت الشخص الذي كان بداخلك\n\n~ ميتسوشا مياموزا\n(كيمي نو كاوا)",
    "كنز الخبرة. الأحلام تتلاشى بعد أن تستيقظ\n\nهيتوها مياميزو\n(كيمي نو كاوا)",
    "أردت أن أخبرك بذلك... أينما ينتهي بك الأمر في هذا العالم، سأبحث عنك\n\n~ تاكي تاشيبانا\n(كيمي نو كاوا)",
    "الموت ليس لطيفا. إنه مظلم وأسود، وبقدر ما تستطيع أن ترى، فأنت وحدك تمامًا. لا يوجد أحد آخر\n\n~ مي ميساكي","🌚إنِــتٌـبًــهّ🔎لَــگـلَـمًــآتٌــگـ فُــيَـمًـگـنِ أنِٰٰ يَـسِــآمًـحًـــگـ آلَـنَِّٰـــآسِ عٌــلَــيَــهّــآ وٌ لَــٓـگـنِـهّــمً لَـــنِ يَـنِـسِـوٌنِــــهّـــآ📿🌪🌚🦋📜🧸📎💭𝐅𝐚𝐢‌𝐓𝐞𝐒 𝐚𝐓𝐓𝐞𝐧𝐓𝐢‌𝐎𝐧🔍 𝐚‌ 𝐯𝐎𝐬 𝐏𝐚‌𝐫𝐎𝐨𝐋𝐫𝐒 𝐋𝐞𝐒 𝐠𝐄𝐧𝐒 𝐩𝐄𝐢𝐕𝐯𝐄𝐧𝐓 𝐯𝐎𝐮𝐒 𝐩𝐚𝐫𝐃𝐨𝐎𝐧𝐧𝐄𝐫 𝐦𝐚𝐢𝐒 𝐢‌𝐋𝐬 𝐧𝐄 𝐋𝐞𝐬 𝐎𝐮𝐔𝐛𝐋𝐢𝐄𝐫𝐎𝐧𝐓 𝐩𝐏𝐚𝐒📿🌪🌚🦋📜🧸📎💭","الوحدة مؤلمة ، لڪنها أجمل بڪثير من الذين يذڪرونك فقط وقت فراغهم.🖤🥀🌫𝐿𝑜𝑛𝑒𝑙𝑖𝑛𝑒𝑠𝑠 𝑖𝑠 𝑝𝑎𝑖𝑛𝑓𝑢𝑙, 𝑏𝑢𝑡 𝑖𝑡 𝑖𝑠 𝑚𝑢𝑐ℎ 𝑛𝑖𝑐𝑒𝑟 𝑡ℎ𝑎𝑛 𝑡ℎ𝑜𝑠𝑒 𝑤ℎ𝑜 𝑜𝑛𝑙𝑦 𝑟𝑒𝑚𝑖𝑛𝑑 𝑦𝑜𝑢 𝑜𝑓 𝑡ℎ𝑒𝑖𝑟 𝑓𝑟𝑒𝑒 𝑡𝑖𝑚𝑒..","بعض الاصدقاء في الحقيقة هم ليسوا اصدقاء ، إنهم أهل 🌱🤍.𝐒𝐎𝐌𝐄 𝐅𝐑𝐈𝐄𝐍𝐃𝐒 𝐀𝐑𝐄𝐍𝐓 𝐑𝐄𝐀𝐋𝐋𝐘 𝐅𝐑𝐈𝐄𝐍𝐃𝐒 𝐓𝐇𝐄𝐘𝐑𝐄 𝐅𝐀𝐌𝐈𝐋𝐘.","🙂•🤎🧸💭 تــمــآديــت بـ آحـلآمـي ، ونـسـيـت آن آلقـدر مكتوب.🥺🧷💭ılı.lıllılı.ıllı.ılı.lıllılı.ıll✶\n•┈┈┈┈•❉❉•┈┈┈┈•✶•\n🥺🧷💭 𝒅𝒊𝒅 𝑴𝒚 𝑫𝒓𝒆𝒂𝒎𝒔, 𝒂𝒏𝒅 𝑰 𝒇𝒐𝒓𝒈𝒐𝒕 𝑻𝒉𝒂𝒕 𝒇𝒂𝒕𝒆 𝒊𝒔 🤎🧸💭","‎آنآ نجمة 🤤🖤✨والنجوم لآ تسقط يآ عزيزي 💭🦋🥀   𝓲 𝓪𝓶 𝓐 𝓼𝓽𝓪𝓻 ✨🥀𝓐𝓷𝓭 𝓽𝓱𝓮 𝓢𝓣𝓐𝓡 𝓓𝓞 𝓷𝓸𝓽 𝓕𝓪𝓛𝓛 🥺📎𝓜𝓨 𝓓ear 🤤🖤‎","🧸🥀🪶🗞️🧸أخبروا من يظنون بأنهم قصة كبيرة بأننا لا نقرأ الرويات💭🧿🍂𝓓𝓲𝓽𝓮𝓼 𝓪̀ 𝓬𝓮𝓾𝔁 𝓺𝓾𝓲 𝓹𝓮𝓷𝓼𝓮𝓷𝓽 𝓺𝓾𝓮 𝓬'𝓮𝓼𝓽 𝓾𝓷𝓮 𝓰𝓻𝓪𝓷𝓭𝓮 𝓱𝓲𝓼𝓽𝓸𝓲𝓻𝓮 𝓺𝓾'𝓸𝓷 𝓷𝓮 𝓵𝓲𝓽 𝓹𝓪𝓼 𝓭𝓮 𝓻𝓸𝓶𝓪𝓷𝓼  🤍💭🧿🍂 00:00 ◉━━━━━━━━━━◉","• اَلْحَيـَــاةْ 🥀♡ أَفْـــضَلْ عِــــنْدَمَــا لاَ تَهْتَــمْ ♡✌🏻...•𝑳𝒊𝐟𝒆 ♡🥀 𝑰𝒔 𝒃𝒆𝒕𝒕𝒆𝒓 𝒘𝒉𝒆𝒏 𝒚𝒐𝒖 𝒅𝒐𝒏'𝑻 𝑪𝒂𝒓𝒆 ♡✌🏻...🍁🍂━_✘✘_━🍂🍁 00:00 ◉━━━━━━◉━━00:07 ⇆ㅤ◁ㅤ❚❚ㅤ▷ㅤㅤ↻","لَآ تٌسِآلَنِيَ عٌنِ وٌطِنِيَ لَآنِنِيَ جّعٌلَتٌهّ فُيَ يَدٍيَکْ 🥺 وٌلَآ تٌسِآلَتٌيَ عٌنِ قُدٍر حًبًيَ لَکْ لَآنِ حًبًکْ لَيَسِ لَه حًدٍوٌدٍ 🩷🧸....! ♡ ✧احبك فيليكس ✧ ↺ ──── ❚❚ ──── ↻ 𝗗𝗼 𝗻𝗼𝘁 𝗮𝘀𝗸 𝗺𝗲 𝗮𝗯𝗼𝘂𝘁 𝗺𝘆  𝗵𝗼𝗺𝗲𝗹𝗮𝗻𝗱  𝗗𝗼 𝗻𝗼𝘁 𝗮𝘀𝗸 𝗺𝗲 𝗳𝗼𝗿 𝗶 𝗵𝗮𝘃𝗲 𝗺𝗮𝗱𝗲 𝗶𝘁 𝗶𝗻 𝘆𝗼𝘂 𝗵𝗮𝗻𝗱🥺 𝗔𝗻𝗱 𝗱𝗼 𝗻𝗼𝘁 𝗮𝘀𝗸 𝗺𝗲 𝗵𝗼𝘄 𝗺𝘂𝗰𝗵 𝗶 𝗹𝗼𝘃𝗲 𝘂 𝗯𝗲𝗰𝗮𝘂𝘀𝗲 𝘆𝗼𝘂𝗿 𝗹𝗼𝘃𝗲 𝗵𝗮𝘀 𝗻𝗼 𝗟𝗜𝗠𝗜𝗧𝗦 🩷🧸....! ♡    ✧𝓛𝓸𝓿𝓮 𝓕𝓮𝓵𝓲𝓼𝓬✧↺ ──── ❚❚ ──── ↻","🌚إنِــتٌـبًــهّ🔎لَــگـلَـمًــآتٌــگـ فُــيَـمًـگـنِ أنِٰٰ يَـسِــآمًـحًـــگـ آلَـنَِّٰـــآسِ عٌــلَــيَــهّــآ وٌ لَــٓـگـنِـهّــمً لَـــنِ يَـنِـسِـوٌنِــــهّـــآ📿🌪🌚🦋📜🧸📎💭𝐅𝐚𝐢‌𝐓𝐞𝐒 𝐚𝐓𝐓𝐞𝐧𝐓𝐢‌𝐎𝐧🔍 𝐚‌ 𝐯𝐎𝐬 𝐏𝐚‌𝐫𝐎𝐨𝐋𝐫𝐒 𝐋𝐞𝐒 𝐠𝐄𝐧𝐒 𝐩𝐄𝐢𝐕𝐯𝐄𝐧𝐓 𝐯𝐎𝐮𝐒 𝐩𝐚𝐫𝐃𝐨𝐎𝐧𝐧𝐄𝐫 𝐦𝐚𝐢𝐒 𝐢‌𝐋𝐬 𝐧𝐄 𝐋𝐞𝐬 𝐎𝐮𝐔𝐛𝐋𝐢𝐄𝐫𝐎𝐧𝐓 𝐩𝐏𝐚𝐒📿🌪🌚🦋📜🧸📎💭"
    ];

    const json = JSON.parse(fs.readFileSync('quots.json'));
    const data = json[Math.floor(Math.random() * json.length)];
    const link = data.link;

    // Choose a random message
    const randomMessage = messages[Math.floor(Math.random() * messages.length)];

    // Send the message with image
    message.reply({
      body: randomMessage,
      attachment: await global.utils.getStreamFromURL(link)
    });
  }
};
