module.exports = {
	config: {
		name: "جمال",
		version: "1.0",
		author: "Samir",
		role: 0,
		category: "متعة",
		guide: {
			vi: "Just For Fun",
			en: "قم بحساب نسبة جمالك"
		} 
	},

	onStart: async function ({ api, event }) {
      const data = ["أنت 1% جميل🫠", "أنت 2% جميل🫠", "أنت 3% جميل🫠", "أنت 4% جميل🫠", "أنت 5% جميل🫠", "أنت 6% جميل🫠", "أنت 7% جميل🫠", "أنت 8% جميل🫠", "أنت 9% جميل🫠", "أنت 10% جميل🫠", "أنت 11% جميل🫠", "أنت 12% جميل🫠", "أنت 13% جميل🫠", "أنت 14% جميل🫠", "أنت 15% جميل🫠", "أنت 16% جميل🫠", "أنت 17% جميل🫠", "أنت 18% جميل🫠", "أنت 19% جميل🫠", "أنت 20% جميل🫠", "أنت 21% جميل🫠", "أنت 22% جميل🫠", "أنت 23% جميل🫠", "You are 24% جميل🫠", "أنت 25% جميل🫠", "أنت 26% جميل🫠", "أنت 27% جميل🫠", "أنت 28% جميل🫠", "أنت 29% جميا🫠", "أنت 30% جميل🫠", "أنت31% جميل🫠", "أنت 32% جميل🫠", "أنت 33% جميل🫠", "أنت 34% جميل🫠", "أنت 35% جميل🫠", "أنت 36% جميل🫠", "أنت 37% جميل🫠", "أنت 38% جميل🫠", "أنت 39% جميل🫠", "أنت 40% جميل🫠", "أنت 41% جميل🫠", "أنت 42% جميل🫠", "أنت 43% جميل🫠", "أنت 44% جميل🫠", "أنت 45% جميل🫠", "أنت 46% جميل🫠", "أنت 47% جميل🫠", "جميل 48% جميل🫠", "أنت 49% جميل🫠", "أنت 50% جميل🫠", "أنت 51% جميل🫠", "أنت 52% جميل🫠", "أنت 53% جميل🫠", "أنت 54% جميل🫠", "أنت 55% جميل🫠", "أنت 56% جميل🫠", "أنت 57% جميل🫠", "أنت 58% جميل🫠", "أنت 59% جميل🫠", "أنت 60% جميل🫠", "أنت 61% جميل🫠", "أنت 62% جميل🫠", "أنت 63% جميل🫠", "أنت 64% جميل🫠", "أنت 65% جميل🫠", "أنت 66% جميل🫠", "أنت 67% جميل🫠", "أنت 68% جميل🫠", "أنت 69% جميل🫠", "أنت 70% جميل🫠", "أنت 71% جميل🫠", "أنت 72% جميل🫠", "أنت 73% جميل 🫠", "أنت 74% جميل🫠", "أنت 75% جميل🫠", "أنت 76% جميل🫠", "أنت 77% جميل🫠", "أنت 78% جميل🫠", "أنت 79% جميل🫠", "أنت 80% جميل🫠", "أنت 81% جميل🫠", "أنت 82% جميل🫠", "أنت 83% جميل🫠", "أنت 84% جميل🫠", "أنت 85% جميل🫠", "أنت 86% جميل🫠", "أنت 87% جميل🫠", "أنت 88% جميل🫠", "أنت 89% جميل🫠", "أنت 90% جميل🫠", "أنت 91% جميل🫠", "أنت 92% جميل🫠", "أنت 93% جميل🫠", "أنت 94% جميل🫠", "أنت 95% جميل🫠", "أنت 96% جميل🫠", "جميل 97% جميل🫠", "أنت 98% جميل🫠", "أنت 99% جميل🫠", "أوه أوه يا إلهي 😲 الجاذبية الزائدة... سوف يتعطل نظامي 🤯 !!", 
  ];
  return api.sendMessage(`${data[Math.floor(Math.random() * data.length)]}`, event.threadID, event.messageID);
	}
};